## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 5 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| update   | `aws_rds_cluster_parameter_group.enable_audit_logging_v8`                      |
|          | `module.rds_cluster.aws_rds_cluster.cluster`                                   |
|          | `module.rds_cluster.aws_rds_cluster_instance.instances[0]`                     |
|          | `module.rds_cluster.aws_rds_cluster_instance.instances[1]`                     |
|          | `module.rds_cluster.aws_security_group.rds_proxy`                              |
| recreate | `module.rds_cluster.aws_secretsmanager_secret_version.proxy_connection_string` |
| add      | `module.rds_cluster.aws_db_proxy.proxy`                                        |
|          | `module.rds_cluster.aws_db_proxy_default_target_group.this`                    |
|          | `module.rds_cluster.aws_db_proxy_target.target`                                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.enable_audit_logging_v8 will be updated in-place
  ~ resource "aws_rds_cluster_parameter_group" "enable_audit_logging_v8" {
        id          = "wordpress-aurora-mysql8"
        name        = "wordpress-aurora-mysql8"
        tags        = {}
        # (5 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "server_audit_events" -> null
          - value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML" -> null
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "server_audit_logging" -> null
          - value        = "1" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_events"
          + value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_logging"
          + value        = "1"
        }

        # (1 unchanged block hidden)
    }

  # module.rds_cluster.aws_db_proxy.proxy will be created
  + resource "aws_db_proxy" "proxy" {
      + arn                    = (known after apply)
      + debug_logging          = false
      + endpoint               = (known after apply)
      + engine_family          = "MYSQL"
      + id                     = (known after apply)
      + idle_client_timeout    = 1800
      + name                   = "wordpress-proxy"
      + require_tls            = true
      + role_arn               = "arn:aws:iam::729164266357:role/wordpress_rds_proxy"
      + tags                   = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-rds-proxy"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-rds-proxy"
          + "Terraform"  = "true"
        }
      + vpc_security_group_ids = [
          + "sg-0ffeb4f8a74eeab1f",
        ]
      + vpc_subnet_ids         = [
          + "subnet-01c6089a83b13d355",
          + "subnet-073d9db0d5d9f213c",
          + "subnet-0cf5c9e13fc3c306c",
        ]

      + auth {
          + auth_scheme               = "SECRETS"
          + client_password_auth_type = (known after apply)
          + description               = "The database connection string"
          + iam_auth                  = "DISABLED"
          + secret_arn                = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress-vsavkj-4weOS1"
            # (1 unchanged attribute hidden)
        }
    }

  # module.rds_cluster.aws_db_proxy_default_target_group.this will be created
  + resource "aws_db_proxy_default_target_group" "this" {
      + arn           = (known after apply)
      + db_proxy_name = "wordpress-proxy"
      + id            = (known after apply)
      + name          = (known after apply)
    }

  # module.rds_cluster.aws_db_proxy_target.target will be created
  + resource "aws_db_proxy_target" "target" {
      + db_cluster_identifier = "wordpress-cluster"
      + db_proxy_name         = "wordpress-proxy"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + port                  = (known after apply)
      + rds_resource_id       = (known after apply)
      + target_arn            = (known after apply)
      + target_group_name     = (known after apply)
      + tracked_cluster_id    = (known after apply)
      + type                  = (known after apply)
    }

  # module.rds_cluster.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      ~ db_cluster_parameter_group_name     = "wordpress-aurora-mysql8" -> "wordpress-aurora-mysql57"
      ~ engine_version                      = "8.0.mysql_aurora.3.06.0" -> "5.7.mysql_aurora.2.11.5"
        id                                  = "wordpress-cluster"
        tags                                = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress-cluster"
            "Terraform"  = "true"
        }
        # (49 unchanged attributes hidden)
    }

  # module.rds_cluster.aws_rds_cluster_instance.instances[0] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "instances" {
      ~ engine_version                        = "8.0.mysql_aurora.3.06.0" -> "5.7.mysql_aurora.2.11.5"
        id                                    = "wordpress-instance-0"
        tags                                  = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress-instance-0"
            "Terraform"  = "true"
        }
        # (31 unchanged attributes hidden)
    }

  # module.rds_cluster.aws_rds_cluster_instance.instances[1] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "instances" {
      ~ engine_version                        = "8.0.mysql_aurora.3.06.0" -> "5.7.mysql_aurora.2.11.5"
        id                                    = "wordpress-instance-1"
        tags                                  = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress-instance-1"
            "Terraform"  = "true"
        }
        # (31 unchanged attributes hidden)
    }

  # module.rds_cluster.aws_secretsmanager_secret_version.proxy_connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress-vsavkj-proxy-connection-string-kAtTG2" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress-vsavkj-proxy-connection-string-kAtTG2|947DD633-4AA4-474E-80A2-CC7FAE5F218F" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "947DD633-4AA4-474E-80A2-CC7FAE5F218F" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.rds_cluster.aws_security_group.rds_proxy will be updated in-place
  ~ resource "aws_security_group" "rds_proxy" {
        id                     = "sg-0ffeb4f8a74eeab1f"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 3306
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - description      = "Client VPN ingress to the database"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-098ae48afb5d878b3",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 3306
            },
        ]
        name                   = "wordpress_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging_v8"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_name"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_username"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
